//Resource Lock deleted
AzureActivity
| where OperationNameValue == "MICROSOFT.AUTHORIZATION/LOCKS/DELETE"
| where ActivityStatusValue == "Start"
| project OperationNameValue , ResourceGroup, Caller, CallerIpAddress, TimeGenerated 
